[
  {
    "date":"October 17th, 10am-6pm",
    "day":"Monday",
    "mc": "MC: Matt McNulty",
    "sessions":[
      {
        "name": "Registration",
        "time": "Monday 8-10am",
        "desc": "Pick up your badge, goodies, and enjoy breakfast. You must have a government-issued photo ID to receive a badge and check in to the event."
      },
      {
        "name":"Opening Keynote",
        "time": "Monday 10am",
        "speaker":"Taylor Savage",
        "video":"https://www.youtube.com/watch?v=VBbejeKHrjg&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc":"Welcome to the second Polymer Summit! We'll kick off with a whirlwind tour of what's new in the world of web components and the Polymer Project."
      },
      {
        "name": "The Way of the Web @ ING",
        "time": "Monday ~10:20am",
        "speaker": "Ben Issa",
        "video": "https://www.youtube.com/watch?v=8ZTFEhPBJEE&index=4&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "An end-to-end view on how ING builds beautiful experiences for its customers using web components."
      },
      {
        "name": "A Polymer Experience",
        "time": "Monday ~10:50am",
        "speaker": "Wendy Ginsberg",
        "video": "https://www.youtube.com/watch?v=o_nDiWMMRIs&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=6",
        "desc": "A sneak preview of a unique experience we've been working on, built with Polymer."
      },
      {
        "name": "Morning Break &  Ask Polymer Lounge",
        "time": "Monday ~11am",
        "desc": "Coffee, tea, and a light snack. Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "Codelab: Building a PWA from Scratch",
        "time": "Monday 11:00am in Room EM 1",
        "speaker": "Emmanuel Garcia",
        "desc": "In this codelab, you’ll build a Progressive Web App in Polymer that will let users watch videos from the Chrome developer channel. You will learn how to set up the pages, layout, routes, and an infinite list."
      },
      {
        "name": "Polymer 2.0: Under the Hood",
        "time": "Monday ~11:30am",
        "speaker": "Rob Dodson",
        "video": "https://www.youtube.com/watch?v=iJ9hS54BRag&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=8",
        "desc": "It's not always clear to developers the boundaries between native web components and Polymer. What does the library add? What's already built into the platform? This talk aims to demystify Polymer by peeling back the cover to explain how the internals work and show how they complement existing APIs. We'll cover the basics of building vanilla web components using the new v1 specs, and demonstrate new features in Polymer 2.0 that make the whole process more efficient."
      },
      {
        "name": "Polymer 2.0 in 2.0 seconds: Upgrading Projects Large and Small",
        "time": "Monday ~12:00pm",
        "speaker": "Peter Burns",
        "video": "https://www.youtube.com/watch?v=iI3G-tzbC_Q&index=10&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "Do you dread upgrading your giant world-spanning tree of Polymer elements? Or maybe you've got a handful of small but widely used elements that you'd like to upgrade without leaving your users in the lurch or maintaining two branches? No worries, we've got your back!"
      },
      {
        "name": "Polymer Butter and Firebase Jelly",
        "time": "Monday ~12:10pm",
        "speaker": "Michael Bleigh",
        "video": "https://www.youtube.com/watch?v=f7ODNJKh3Yg&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=12",
        "desc": "Polymer helps you use the platform to build performant, responsive, delightful web apps. Firebase helps you do it without having to run your own backend infrastructure! Polymer and Firebase have joined forces to put Progressive Web Apps within the reach of mere mortal developers. In this session, you'll learn how to leverage PolymerFire (the official Polymer bindings for Firebase) to handle authentication, data (both online and off), and more in your Polymer application. You'll also learn how you can use Firebase Hosting to deliver your app lightning-fast using the PRPL pattern. Get the tools you need to go from zero to PWA in record time."
      },
      {
        "name": "Data Flow in Polymer Elements and Apps",
        "time": "Monday ~12:40pm",
        "speaker": "Gray Norton",
        "video": "https://www.youtube.com/watch?v=pAW4YDLtPVs&index=14&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "Polymer’s data system provides a robust, highly performant set of features – including observers, computed properties and bindings – for managing the flow of data within and between elements. These features are easy to use, making it almost trivial to build simple controls. They’re also useful for composing more complex elements (fancier controls, views or entire applications), but data flow gets trickier as complexity increases and the best solution is not always obvious. In this session, we’ll explore patterns for managing data flow in your Polymer elements and apps and discuss relevant changes in Polymer 2.0."
      },
      {
        "name": "Lunch & Ask Polymer Lounge",
        "time": "Monday 1:00pm",
        "desc": "Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "Evolving chromestatus.com into a Lightning-Fast PWA",
        "time": "Monday 2:00pm",
        "speaker": "Eric Bidelman",
        "video": "https://www.youtube.com/watch?v=Rd0plknSPYU&index=16&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "How do you build a production app using web components? How do you make it fast? Chromestatus.com was launched in 2013 as part of the Blink fork and quickly became an everyday tool used by Chrome engineers, browser vendors, and web developers around the world. As the 1st production app built with Polymer, it has evolved quite a bit over the years. In this talk, you'll learn what it takes to build a lightning fast PWA using web components. Topics include incorporating Polymer elements, lazy loading patterns, utilizing http/2 push/preload, and more."
      },
      {
        "name": "Do Less & Be Lazy",
        "time": "Monday ~2:30pm",
        "speaker": "Steve Orvell",
        "video": "https://www.youtube.com/watch?v=hHC9EOJzrQk&index=17&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "The web platform is powerful and performant, and custom elements are a profound new platform primitive. Polymer is a library that helps developers realize the potential of the platform to please and delight users. From paradigms to pointers we’ll review a plethora of concepts and examples to make sure you’re prepared to write applications that are truly paragons of performance."
      },
      {
        "name": "Polymer & the Closure Compiler",
        "time": "Monday ~2:45pm",
        "speaker": "Sam Thorogood",
        "video": "https://www.youtube.com/watch?v=CplQdSo7lkE&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=19",
        "desc": "Closure Compiler underpins most of Google's frontends - providing typechecking, minification and transpilation - but can be tricky to be used with Polymer. Learn about how to use the compiler in SIMPLE or ADVANCED mode to be more productive and write better Polymer code."
      },
      {
        "name": "Production-Ready Polymer Elements - A How-To-Guide",
        "time": "Monday ~3:00pm",
        "speaker": "Daniel Freedman",
        "video": "https://www.youtube.com/watch?v=T35IgjN9IwY&index=20&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "The Polymer team is responsible for over one hundred elements that are used in vast assortment of combinations, browsers, and applications. Come learn how we make our elements production ready, and how to use the same tools and techniques for your own elements. We'll explore topics such as Code Linting with eslint, In-Browser testing with web-component-tester, Fixture testing with the <test-fixture> element, Accessibility Testing with accessibility-developer-tools, web-component-tester, and VoiceOver, and finally Continuous Integration Testing with Travis-CI and Sauce Labs."
      },
      {
        "name": "Break & Ask Polymer Lounge",
        "time": "Monday ~3:15pm",
        "desc": "Tea and cookies. Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "Codelab: Building an Image Carousel Element with Polymer 2.0",
        "time": "Monday 3:15pm in Room EM1",
        "speaker": "Keanu Lee",
        "desc": "In this codelab, you’ll learn how to build a simple image carousel element with Polymer 2.0. You’ll learn how to use ES2015 syntax to write a Polymer element, changes in Custom Elements V1 and Shadow DOM V1, and considerations to make when designing your element’s API."
      },
      {
        "name": "Practical Performance",
        "time": "Monday 4:00pm",
        "speaker": "Sam Saccone & Paul Irish",
        "video": "https://www.youtube.com/watch?v=6m_E-mC0y3Y&index=21&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "A look into how to identify why a site is slow with Dev Tools, and techniques based around the PRPL pattern to make things fast again."
      },
      {
        "name": "Interacting with the Physical Web",
        "time": "Monday ~4:20pm",
        "speaker": "Scott Jenson",
        "video": "https://www.youtube.com/watch?v=_aygWy0dP3k&index=22&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "The Physical Web is an ultra simple way to find and interact with devices around you, all without ever having to install an app. This talk will introduce you to the Physical Web and also show you how easy it is to add interactivity to devices. We'll show a demo of a device that initially shows nothing more than a simple web page, but by adding a single Polymer component lets you connect and interact with that device through WebBluetooth."
      },
      {
        "name": "Hacking Without Being a Hack",
        "time": "Monday ~4:40pm",
        "speaker": "Elliott Marquez",
        "video": "https://www.youtube.com/watch?v=CBSLki5opb4&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=23",
        "desc": "Almost everyone has had a moment when they have been asked to build something quickly at 3pm on a Friday. Come explore how Polymer can transform a hackathon project or last-minute demo into a respectable app."
      },
      {
        "name": "Monster Apps",
        "time": "Monday ~4:50pm",
        "speaker": "Chris Joel",
        "video": "https://www.youtube.com/watch?v=2_5X-mQdLXc&index=24&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "You've done it. You've survived long enough as a web developer to witness the dawn of progressive web apps. Web apps now share the home screen with native apps, and have many of the same capabilities. But, with great power comes great user expectations. How do you achieve the delightful 60FPS view transitions on that native app your user just installed? How do you manage the burden of heavy image assets when every byte counts? How do you avoid jank when your app needs to do _real_ work? The Web Platform and Polymer Elements are here to help. In this session, we'll cover accessible strategies for delightful UX by leveraging the powerful primitives of the web. You will learn from real-world examples of heavy duty web app workloads. You will discover how to build and analyze these features to achieve a satisfying, high performance UX. And most importantly: you will learn how to make these features progressive, so that users across all browsers and devices can benefit from your work."
      },
      {
        "name": "An app in 3 days or: how I learned to stop worrying and love the Polymer toolbox",
        "time": "Monday 5:15pm",
        "speaker": "Monica Dinculescu",
        "video": "https://www.youtube.com/watch?v=6t2JRKTCYbI&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=26",
        "desc": "Think of your favorite app. It's probably meowni.ca/emojillate (who can blame you), but if it isn't (and we need to talk) it probably has one, if not all, of these things: a database; a potential for disaster, with many users looking at and clicking on the same data; offline support, and a responsive layout. While preferably being faster than the average bear. Recreating this from scratch might sound like a terrifying experience, but I'm going to show you how the polymer toolbox and a few other already-built elements can help you go from zero to hero and build a PWA in no time."
      },
      {
        "name": "Ask Polymer Lounge",
        "time": "Monday 5:45pm",
        "desc": "Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "After Party",
        "time": "Monday 6:00pm-10:00pm",
        "desc": "Hang out with the Polymer team and enjoy music, buffet dinner, and drinks (non-alcoholic cocktail, specialty cocktail, beer, wine, and more)."
      }
    ]
  },
  {
    "date":"October 18th, 10am-6pm",
    "day":"Tuesday",
    "mc": "MC: Meownica",
    "sessions":[
      {
        "name": "Registration/Breakfast",
        "time": "Tuesday 8-10am",
        "desc": "If you didn’t get your badge on Day 1, you can still get your badge and goodies. Breakfast will also be served. You must have a government-issued photo ID to receive a badge and check in to the event."
      },
      {
        "name": "Women Techmakers Breakfast",
        "time": "Tuesday 9-10am",
        "desc": "Grab some coffee and breakfast and come join the women of the Polymer team for a morning meetup!"
      },
      {
        "name":"Opening Remarks",
        "time": "Tuesday 10:00am",
        "speaker":"Dion Almaer",
        "video": "https://www.youtube.com/watch?v=1pJYuuUrUzM&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=27",
        "desc":"Welcome to day 2 of the Polymer Summit."
      },
      {
        "name": "What's New in Polymer Tools",
        "time": "Tuesday ~10:10am",
        "speaker": "Justin Fagnani",
        "video": "https://www.youtube.com/watch?v=guYHn0P8bKQ&index=28&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "An end-to-end overview of the tooling landscape for web components and the Polymer Project. From the Polymer CLI, to package managers, to static analyzers, to linters, to deployment tools, we'll take a look at the current state of tooling and show off new features that are in progress and on the horizon."
      },
      {
        "name": "Break & Ask Polymer Lounge",
        "time": "Tuesday 11:00am",
        "desc": "Coffee, tea, and a light snack. Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "Codelab: Polymer Firebase PWA",
        "time": "Tuesday 11:00am in Room EM1",
        "speaker": "Chris Joel",
        "desc": "In this codelab, you'll learn how to make a progressive web app using Firebase and Polymer Web Components. You'll connect pre-made view components to Firebase data components to build an app that features user authentication, a database backend, offline data availability and the ability to be installed to the home screen of an Android device."
      },
      {
        "name": "Polymer in Practice @ Comcast",
        "time": "Tuesday 11:30am",
        "speaker": "Chris Lorenzo & John Riviello",
        "video": "https://www.youtube.com/watch?v=dZo7Tqr2lqI&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=29",
        "desc": "Comcast is an early adopter of Polymer, having been building production web applications since version 0.3. Now millions of Comcast customers are using websites and web applications that are built with Polymer. This session will walk through our transformation from early skepticism about a new technology choice to widespread enthusiasm for Polymer throughout the largest cable TV & Internet provider in the United States. You’ll learn about how easy it is to onboard a team to Polymer, tips for sharing components with other websites & across teams, and best practices Comcast has established for efficient development & deployment of web components."
      },
      {
        "name": "Why the web makes sense for business apps - Vaadin",
        "time": "Tuesday ~12:00pm",
        "speaker": "Marcus Hellberg & Jouni Koivuviita",
        "video": "https://www.youtube.com/watch?v=n8xrfe-XjfI&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=31",
        "desc": "Web components and Progressive Web App technologies offer a solution to fragmented development and runtime environments by allowing you to reuse code between both frameworks and platforms. Vaadin works simplifies the development of business apps by providing UI components and tools that are focused on helping business app developers. In this talk, you will learn how Polymer components can be used in Angular 2 and how we are making web components customizable, so you can easily adapt them to the look and feel of your company and platform. "
      },
      {
        "name": "From Components to Applications @ NET-A-PORTER",
        "time": "Tuesday ~12:30pm",
        "speaker": "Robin Glen",
        "video": "https://www.youtube.com/watch?v=DwrLEd0gBcA&index=33&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "Since Polymer Summit 2015 the NET-A-PORTER tech team set about building on top of their work with web components and start building applications. This talk will cover that journey, including how they build, test and monitor their latest product listing page."
      },
      {
        "name": "Lunch & Ask Polymer Lounge",
        "time": "Tuesday 1:00pm",
        "desc": "Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "Winning the Gold with Web Components - Gannett",
        "time": "Tuesday 2:00pm",
        "speaker": "Jesiah McCann & Josh Trout",
        "video": "https://www.youtube.com/watch?v=0j16VC5z4_s&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=35",
        "desc": "Join us for a look into the complex reporting behind the Rio 2016 Olympics, and how USA TODAY utilized Polymer (for the first time) to build out their data driven Olympics experience. With only 30 days to spare, the team (full of many new members) embraced Polymer and the Platform to deliver the Olympic schedule and results, medal counts, and athlete bios—along with latest stories and videos from Rio. The team will also be giving a sneak peak at their Elections 2016 experience."
      },
      {
        "name": "Sign-in and Payments without Forms",
        "time": "Tuesday ~2:30pm",
        "speaker": "Eiji Kitamura",
        "video": "https://www.youtube.com/watch?v=NDZw7vtoYnU&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ&index=36",
        "desc": "This talk gives you ideas on how you can bring sign-in and checkout process to the next level in your Polymer PWA using Credential Management API and Payment Request API."
      },
      {
        "name": "We'll Do It Live!",
        "time": "Tuesday ~2:45pm",
        "speaker": "Paul Lewis and Surma",
        "video": "https://www.youtube.com/watch?v=r94IxRRKR0A&index=38&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "Paul and Surma will live-code a UI element from scratch, using ES2015, Custom Elements and Shadow DOM. Yeah, because live-coding never goes wrong. And to make matters worse, you can bombard them with questions live, too."
      },
      {
        "name": "Break & Ask Polymer Lounge",
        "time": "Tuesday 3:45pm",
        "desc": "Tea and cookies. Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      },
      {
        "name": "Codelab: Building Custom Overlays",
        "time": "Tuesday 3:45pm in Room EM1",
        "speaker": "Valdrin Koshi",
        "desc": "This codelab shows the common challenges in building an overlay system that is accessible and correctly renders on the top layer’s stacking context."
      },
      {
        "name": "Adapting to the Mobile Web F̶u̶t̶u̶r̶e̶ Present",
        "time": "Tuesday 4:15pm",
        "speaker": "Alex Russell",
        "video": "https://www.youtube.com/watch?v=K1SFnrf4jZo&index=39&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "Mobile isn't everything, but it's not far off. The mobile web of today includes devices out at the edge of the web’s considerable reach, with unexpectedly harsh limits on available CPU imposed by batteries and thermal throttling. Our assumptions about what we can “afford” are off. Not by a little; by a lot. Modern apps often include an order of magnitude too much script...and your Macbook Pro doesn’t make this obvious, and your framework might have hidden costs. Frameworks and apps need to adapt. Learn how to diagnose bloat for yourself, techniques for attacking it, and how to keep your app under a reasonable performance budget from start to finish."
      },
      {
        "name": "Polymer Panel",
        "time": "Tuesday ~4:45pm",
        "video": "https://www.youtube.com/watch?v=dFxMzUUWLeM&index=40&list=PLNYkxOF6rcICc687SxHQRuo9TVNOJelSZ",
        "desc": "A roundtable Q&A with core Polymer team members on the past, present, and future of the Polymer Project."
      },
      {
        "name": "Closing Remarks",
        "time": "Tuesday ~5:15pm",
        "speaker": "Matt McNulty",
        "desc": "A look ahead at the future of the Polymer Project and web components."
      },
      {
        "name": "Ask Polymer Lounge",
        "time": "Tuesday 5:30pm",
        "desc": "Do you have questions you want to ask the speakers from the previous sessions? Join the speakers in the Ask Polymer Lounge for face to face Q&A time!"
      }
    ]
  }
]
